Revit 2027 API
BoundaryConditions.AssociatedLoadId Property
 The Id of the internal load element associated with a boundary conditions.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId AssociatedLoadId { get; set; }
Public Property AssociatedLoadId As ElementId
	Get
	Set
public:
property ElementId^ AssociatedLoadId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member AssociatedLoadId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: elementId is not a valid Element identifier. -or- When setting this property: ElementId does not refer to the internal load with appropriate type.
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
 ElementId may be set if the internal load exists and it's type fit the BoundaryConditions type only (Point, Line and Area).
See Also
Reference
BoundaryConditions Class
Autodesk.Revit.DB.Structure Namespace